### numpy

# Pandas

In [2]:
import pandas as pd

In [3]:
pd

In [13]:
students = pd.Series(['Nikita', 'Saule', 'Ekaterina', 'Kirill'])

In [20]:
students

0       Nikita
1        Saule
2    Ekaterina
3       Kirill
dtype: object

In [21]:
points = pd.Series([70, 80, 90, 100])

In [22]:
points

0     70
1     80
2     90
3    100
dtype: int64

In [23]:
result = pd.Series([70, 80, 90, 100], index=['Nikita', 'Saule', 'Ekaterina', 'Kirill'])

In [24]:
result

Nikita        70
Saule         80
Ekaterina     90
Kirill       100
dtype: int64

In [35]:
#Serias gives us number by row when we specify our index (exp. 0)
# but Pndas gives us column (look below section 37)

result[0]

70

In [30]:
result < 90

Nikita        True
Saule         True
Ekaterina    False
Kirill       False
dtype: bool

In [31]:
result == 90

Nikita       False
Saule        False
Ekaterina     True
Kirill       False
dtype: bool

In [32]:
# dataframe  is spreadsheet based on serias

data = pd.DataFrame([
    ['Nikita', 12, 'm', 'msk'],
    ['Saule', 18, 'f', 'ekb'],
    ['Ekaterina', 18, 'f', 'nvs'],
    ['Kirill', 69, 'm', 'msk']
])

In [38]:
data

           0   1  2    3
0     Nikita  12  m  msk
1      Saule  18  f  ekb
2  Ekaterina  18  f  nvs
3     Kirill  69  m  msk

In [37]:
#Pandas gives us column by applying as index:

data[1]

0    12
1    18
2    18
3    69
Name: 1, dtype: int64

In [40]:
# if we want to recive row when we apply by index we should use Loc[] command
# we recieve data of rows but in kind of column

data.loc[1]

0    Saule
1       18
2        f
3      ekb
Name: 1, dtype: object

In [86]:
data_null = pd.DataFrame([
    ['Nikita'],
    ['Saule', 18],
    ['Ekaterina', 18],
    ['Kirill', 69, 'm', 'msk']
])

In [87]:
# None is used for data of Object Type 
# NaN is used for data of Decimal type

data_null

           0     1     2     3
0     Nikita   NaN  None  None
1      Saule  18.0  None  None
2  Ekaterina  18.0  None  None
3     Kirill  69.0     m   msk

In [43]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
data.columns

RangeIndex(start=0, stop=4, step=1)

In [46]:
data = pd.DataFrame([
    ['Nikita', 12, 'm', 'msk'],
    ['Saule', 18, 'f', 'ekb'],
    ['Ekaterina', 18, 'f', 'nvs'],
    ['Kirill', 69, 'm', 'msk']
], columns=['name', 'age', 'gender', 'city'])

In [47]:
data

        name  age gender city
0     Nikita   12      m  msk
1      Saule   18      f  ekb
2  Ekaterina   18      f  nvs
3     Kirill   69      m  msk

In [49]:
data['name']

0       Nikita
1        Saule
2    Ekaterina
3       Kirill
Name: name, dtype: object

In [52]:
data.columns

Index(['name', 'age', 'gender', 'city'], dtype='object')

In [54]:
list(data.columns)

['name', 'age', 'gender', 'city']

In [57]:
for i in list(data.columns):
    print(i)
    print(data[i])
    print()

name
0       Nikita
1        Saule
2    Ekaterina
3       Kirill
Name: name, dtype: object

age
0    12
1    18
2    18
3    69
Name: age, dtype: int64

gender
0    m
1    f
2    f
3    m
Name: gender, dtype: object

city
0    msk
1    ekb
2    nvs
3    msk
Name: city, dtype: object

In [58]:
data

        name  age gender city
0     Nikita   12      m  msk
1      Saule   18      f  ekb
2  Ekaterina   18      f  nvs
3     Kirill   69      m  msk

In [59]:
# how to give name to columns and to rows:

data = pd.DataFrame(
[
    ['Nikita', 12, 'm', 'msk'],
    ['Saule', 18, 'f', 'ekb'],
    ['Ekaterina', 18, 'f', 'nvs'],
    ['Kirill', 69, 'm', 'msk']
], 
    columns=['name', 'age', 'gender', 'city'],
    index=['persona1', 'persona2', 'persona3', 'persona4']
)

In [60]:
data

               name  age gender city
persona1     Nikita   12      m  msk
persona2      Saule   18      f  ekb
persona3  Ekaterina   18      f  nvs
persona4     Kirill   69      m  msk

In [61]:
# how to name rows through formula:

data_test = pd.DataFrame(
[
    ['Nikita', 12, 'm', 'msk'],
    ['Saule', 18, 'f', 'ekb'],
    ['Ekaterina', 18, 'f', 'nvs'],
    ['Kirill', 69, 'm', 'msk']
], 
    columns=['name', 'age', 'gender', 'city'],
    index=[i for i in range(1, 5)]
)

In [62]:
data_test

        name  age gender city
1     Nikita   12      m  msk
2      Saule   18      f  ekb
3  Ekaterina   18      f  nvs
4     Kirill   69      m  msk

In [63]:
data

               name  age gender city
persona1     Nikita   12      m  msk
persona2      Saule   18      f  ekb
persona3  Ekaterina   18      f  nvs
persona4     Kirill   69      m  msk

In [64]:
data['city']

persona1    msk
persona2    ekb
persona3    nvs
persona4    msk
Name: city, dtype: object

In [65]:
data['persona1']

KeyError: 'persona1'

In [66]:
#how to apply to rows:

data.loc['persona1']

name      Nikita
age           12
gender         m
city         msk
Name: persona1, dtype: object

In [73]:
data[data.columns[2]]

persona1    m
persona2    f
persona3    f
persona4    m
Name: gender, dtype: object

In [74]:
data

               name  age gender city
persona1     Nikita   12      m  msk
persona2      Saule   18      f  ekb
persona3  Ekaterina   18      f  nvs
persona4     Kirill   69      m  msk

In [75]:
#Loc use name of rows
#iloc use place (index) of row:

data.iloc[2]

name      Ekaterina
age              18
gender            f
city            nvs
Name: persona3, dtype: object

In [76]:
data

               name  age gender city
persona1     Nikita   12      m  msk
persona2      Saule   18      f  ekb
persona3  Ekaterina   18      f  nvs
persona4     Kirill   69      m  msk

In [77]:
# create new columns:

data['point'] = [70, 80, 90, 100]

In [78]:
data

               name  age gender city  point
persona1     Nikita   12      m  msk     70
persona2      Saule   18      f  ekb     80
persona3  Ekaterina   18      f  nvs     90
persona4     Kirill   69      m  msk    100

In [79]:
data['future'] = data['age'] + 50

In [80]:
data

               name  age gender city  point  future
persona1     Nikita   12      m  msk     70      62
persona2      Saule   18      f  ekb     80      68
persona3  Ekaterina   18      f  nvs     90      68
persona4     Kirill   69      m  msk    100     119

In [81]:
data['logins'] = data['name'] + '_' + data['city']

In [82]:
data

               name  age gender city  point  future         logins
persona1     Nikita   12      m  msk     70      62     Nikita_msk
persona2      Saule   18      f  ekb     80      68      Saule_ekb
persona3  Ekaterina   18      f  nvs     90      68  Ekaterina_nvs
persona4     Kirill   69      m  msk    100     119     Kirill_msk

In [83]:
# info disclouses for us information about dataframe (Nulls cells are ignored)

data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, persona1 to persona4
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   gender  4 non-null      object
 3   city    4 non-null      object
 4   point   4 non-null      int64
 5   future  4 non-null      int64
 6   logins  4 non-null      object
dtypes: int64(3), object(4)
memory usage: 428.0+ bytes

In [88]:
data_null.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
 1   1       3 non-null      float64
 2   2       1 non-null      object
 3   3       1 non-null      object
dtypes: float64(1), object(3)
memory usage: 256.0+ bytes

In [89]:
# creating dataframe as vacabulary:

new_data = pd.DataFrame({'position': ['low', 'mid', 'high', 'exp'], 
                         'salary': [10, 20, 30, 40],
                         'years': [1, 3, 5, 9]})

In [90]:
new_data

  position  salary  years
0      low      10      1
1      mid      20      3
2     high      30      5
3      exp      40      9

In [91]:
new_data['position']

0     low
1     mid
2    high
3     exp
Name: position, dtype: object

In [92]:
data

               name  age gender city  point  future         logins
persona1     Nikita   12      m  msk     70      62     Nikita_msk
persona2      Saule   18      f  ekb     80      68      Saule_ekb
persona3  Ekaterina   18      f  nvs     90      68  Ekaterina_nvs
persona4     Kirill   69      m  msk    100     119     Kirill_msk

In [93]:
# data cannot take 3 elements in frame. Only one.
# But we can do it if we wrap array with elements in new array
# because in this case original array will be considered as 1 element

data['name', 'point', 'age']

KeyError: ('name', 'point', 'age')

In [95]:
data_points = data[['name', 'point', 'age']]

In [96]:
data_points

               name  point  age
persona1     Nikita     70   12
persona2      Saule     80   18
persona3  Ekaterina     90   18
persona4     Kirill    100   69

In [97]:
import random as rd

In [99]:
# k=5 - take 5 letters from the text
# rd.choice - 
#rd.randint - 

people = pd.DataFrame({
    'name': [''.join(rd.choices([*'йцукенгшщзхъёфывапролджэячсмитьбю'], k=5)) for i in range(500)],
    'age': [rd.randint(18, 69) for i in range(500)],
    'city': [rd.choice(['msk', 'spb', 'nvs', 'ekb', 'dgs']) for i in range(500)]
})

In [100]:
people

      name  age city
0    тйдэк   44  ekb
1    оырмх   42  msk
2    окъшо   69  nvs
3    йвпзс   63  spb
4    ързфв   21  dgs
..     ...  ...  ...
495  ьиъхз   68  ekb
496  ъыьцй   56  ekb
497  сажжб   21  spb
498  щяжшг   68  msk
499  зщоёь   34  ekb

[500 rows x 3 columns]

In [101]:
#head() - print only 5

people.head()

    name  age city
0  тйдэк   44  ekb
1  оырмх   42  msk
2  окъшо   69  nvs
3  йвпзс   63  spb
4  ързфв   21  dgs

In [102]:
# head(8) - print only 8

people.head(8)

    name  age city
0  тйдэк   44  ekb
1  оырмх   42  msk
2  окъшо   69  nvs
3  йвпзс   63  spb
4  ързфв   21  dgs
5  зтыюв   62  msk
6  мсрпо   22  spb
7  срйсв   55  ekb

In [103]:
people.head(80)

     name  age city
0   тйдэк   44  ekb
1   оырмх   42  msk
2   окъшо   69  nvs
3   йвпзс   63  spb
4   ързфв   21  dgs
..    ...  ...  ...
75  тдауо   37  nvs
76  ъурвг   44  dgs
77  щдфкб   54  spb
78  йсхаю   32  nvs
79  ндщцм   31  nvs

[80 rows x 3 columns]

In [104]:
# from the end

people.tail()

      name  age city
495  ьиъхз   68  ekb
496  ъыьцй   56  ekb
497  сажжб   21  spb
498  щяжшг   68  msk
499  зщоёь   34  ekb

In [105]:
people.tail(8)

      name  age city
492  змтча   68  nvs
493  ыьдьй   31  nvs
494  мэишл   25  spb
495  ьиъхз   68  ekb
496  ъыьцй   56  ekb
497  сажжб   21  spb
498  щяжшг   68  msk
499  зщоёь   34  ekb

In [106]:
people[['name', 'name', 'name']]

      name   name   name
0    тйдэк  тйдэк  тйдэк
1    оырмх  оырмх  оырмх
2    окъшо  окъшо  окъшо
3    йвпзс  йвпзс  йвпзс
4    ързфв  ързфв  ързфв
..     ...    ...    ...
495  ьиъхз  ьиъхз  ьиъхз
496  ъыьцй  ъыьцй  ъыьцй
497  сажжб  сажжб  сажжб
498  щяжшг  щяжшг  щяжшг
499  зщоёь  зщоёь  зщоёь

[500 rows x 3 columns]

In [107]:
# It is Series

people['name']

0      тйдэк
1      оырмх
2      окъшо
3      йвпзс
4      ързфв
       ...
495    ьиъхз
496    ъыьцй
497    сажжб
498    щяжшг
499    зщоёь
Name: name, Length: 500, dtype: object

In [108]:
people[['name']]

      name
0    тйдэк
1    оырмх
2    окъшо
3    йвпзс
4    ързфв
..     ...
495  ьиъхз
496  ъыьцй
497  сажжб
498  щяжшг
499  зщоёь

[500 rows x 1 columns]

In [111]:
#It it is dataframe

people[people.city == 'msk']

      name  age city
1    оырмх   42  msk
5    зтыюв   62  msk
16   эяаяш   48  msk
18   ёачне   51  msk
21   иёзеч   54  msk
..     ...  ...  ...
476  цовюв   57  msk
478  жзсев   27  msk
487  въщщп   69  msk
489  ьпмзн   19  msk
498  щяжшг   68  msk

[85 rows x 3 columns]

In [112]:
people[people.age < 25]

      name  age city
4    ързфв   21  dgs
6    мсрпо   22  spb
27   окйио   20  dgs
39   рщмрг   23  msk
43   иафяя   21  spb
..     ...  ...  ...
455  чдадл   24  dgs
457  глкцй   22  dgs
473  чбшба   24  spb
489  ьпмзн   19  msk
497  сажжб   21  spb

[68 rows x 3 columns]

In [113]:
people[people['age'] < 25][people.city == 'msk']

<ipython-input-113-97cf69658da7>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  people[people['age'] < 25][people.city == 'msk']

      name  age city
39   рщмрг   23  msk
131  зппйы   23  msk
192  фщттч   22  msk
235  сопчэ   21  msk
248  эрчсы   23  msk
269  жчтдё   20  msk
277  сжвфз   24  msk
320  югедъ   21  msk
345  жръяё   22  msk
395  щепуз   20  msk
425  пшвхэ   23  msk
489  ьпмзн   19  msk

In [114]:
people[(people.age < 25) & (people.city == 'msk')]

      name  age city
39   рщмрг   23  msk
131  зппйы   23  msk
192  фщттч   22  msk
235  сопчэ   21  msk
248  эрчсы   23  msk
269  жчтдё   20  msk
277  сжвфз   24  msk
320  югедъ   21  msk
345  жръяё   22  msk
395  щепуз   20  msk
425  пшвхэ   23  msk
489  ьпмзн   19  msk

In [115]:
people[(people.age < 25) | (people.city == 'msk')]

      name  age city
1    оырмх   42  msk
4    ързфв   21  dgs
5    зтыюв   62  msk
6    мсрпо   22  spb
16   эяаяш   48  msk
..     ...  ...  ...
478  жзсев   27  msk
487  въщщп   69  msk
489  ьпмзн   19  msk
497  сажжб   21  spb
498  щяжшг   68  msk

[141 rows x 3 columns]